Catalogs/Renault_КорпоративныеКлиенты_МаркиМодели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Renault_КорпоративныеКлиенты_МаркиМодели</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Модели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Модель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/Renault_КорпоративныеКлиенты_МаркиМодели/Ext/ManagerModule.bsl
Процедура ЗаполнитьМаркиМодели() Экспорт
	
	МакетМарки = ПолучитьМакет("Марки");
	ИндексСтроки = 1;
	Область = МакетМарки.ПолучитьОбласть("R1C" + ИндексСтроки);
	Модель = Область.ТекущаяОбласть.Текст;
	
	Пока ЗначениеЗаполнено(Модель) Цикл
		
		СуществующаяМодель = Справочники.Renault_КорпоративныеКлиенты_МаркиМодели.НайтиПоНаименованию(Модель, Истина);
		Если НЕ ЗначениеЗаполнено(СуществующаяМодель) Тогда
			НовОб = Справочники.Renault_КорпоративныеКлиенты_МаркиМодели.СоздатьЭлемент();
			НовОб.Наименование = Модель;
			НовОб.Записать();
		КонецЕсли;
		
		ИндексСтроки = ИндексСтроки + 1;
		Область = МакетМарки.ПолучитьОбласть("R" + ИндексСтроки + "C1");
		Модель = Область.ТекущаяОбласть.Текст;
		
	КонецЦикла;
	
	МакетМодели = ПолучитьМакет("Модели");
	ИндексСтроки = 2;
	Область = МакетМодели.ПолучитьОбласть("R" + ИндексСтроки + "C1");
	Марка = Область.ТекущаяОбласть.Текст;
	Область = МакетМодели.ПолучитьОбласть("R" + ИндексСтроки + "C2");
	Модель = Область.ТекущаяОбласть.Текст;
	
	ТабМаркиМодели = Новый ТаблицаЗначений;
	ТабМаркиМодели.Колонки.Добавить("Марка");
	ТабМаркиМодели.Колонки.Добавить("Модель");
	
	Пока ЗначениеЗаполнено(Модель) Цикл
		
		НовСтр = ТабМаркиМодели.Добавить();
		НовСтр.Марка = Марка;
		НовСтр.Модель = Модель;
		
		ИндексСтроки = ИндексСтроки + 1;
		Область = МакетМодели.ПолучитьОбласть("R" + ИндексСтроки + "C1");
		Марка = Область.ТекущаяОбласть.Текст;
		Область = МакетМодели.ПолучитьОбласть("R" + ИндексСтроки + "C2");
		Модель = Область.ТекущаяОбласть.Текст;
		
	КонецЦикла;
	
	Копия = ТабМаркиМодели.Скопировать();
	Копия.Свернуть("Марка");
	МассивМарок = Копия.ВыгрузитьКолонку("Марка");
	
	Для Каждого Марка ИЗ МассивМарок Цикл
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("Марка", Марка);
		МассивСтрок = ТабМаркиМодели.НайтиСтроки(СтруктураПоиска);
		ЭлементСпр = Справочники.Renault_КорпоративныеКлиенты_МаркиМодели.НайтиПоНаименованию(Марка);
		Если ЗначениеЗаполнено(ЭлементСпр) Тогда
			Об = ЭлементСпр.ПолучитьОбъект();
			Об.Модели.Очистить();
			Для Каждого СтрМодель ИЗ МассивСтрок Цикл
				НовСтр = Об.Модели.Добавить();
				НовСтр.Модель = СтрМодель.Модель;
			КонецЦикла;
			Об.Записать();
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры
